export const DOT_TRANSFORMATIONS: Record<string, string> = {
  "\u062D": "\u062E", // ح -> خ
  "\u062E": "\u062C", // خ -> ج
  "\u066E": "\u0628", // ب (without dot) -> ب (with dot)
  "\u0628": "\u062A", // ب -> ت
  "\u0646": "\u062A", // ن -> ت
  "\u0647": "\u0629", // ه -> ة
  "\u064E": "\u064B", // فتح -> تنوين فتح
  "\u064F": "\u064C", // ضم -> تنوين ضم
  "\u0650": "\u064D", // كسر -> تنوين كسر
  "\u0631": "\u0632", // ر -> ز
  "\u062F": "\u0630", // د -> ذ
  "\u062A": "\u062B", // ت -> ث
  "\u0637": "\u0638", // ط -> ظ
  "\u0633": "\u0634", // س -> ش
};
